src/cf/InformationRegisters/НастройкиДополнительныхРеквизитовЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДополнительныхРеквизитовЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Квалификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перечисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/НастройкиДополнительныхРеквизитовЭПД/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыДокументовЭПД = Новый Структура;
	
	ОбменСГИСЭПД.ПриОпределенииСтандартныхТиповДокументов(ТипыДокументовЭПД);
	
	Для Каждого КиЗ Из ТипыДокументовЭПД Цикл
		Элементы.ТипДокумента.СписокВыбора.Добавить(КиЗ.Значение);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда
		ЗаполнитьСписокГруппДанных();	
	КонецЕсли;
	
	УстановитьОтборыДинамическогоСписка();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокГруппДанных()
	
	ГруппаДанных = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипДокумента", ТипДокумента);
	Если ЗначениеЗаполнено(ГруппаДанных) Тогда
		ПараметрыФормы.Вставить("ГруппаДанных", ГруппаДанных);
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ГруппаДанныхНачалоВыбора_Завершение", ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.НастройкиДополнительныхРеквизитовЭПД.Форма.ФормаВыбораГруппыДанных", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		УникальныйИдентификатор,,,
		ОписаниеОповещенияОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаДанныхНачалоВыбора_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ГруппаДанных = Результат.ГруппаДанных;
		УстановитьОтборыДинамическогоСписка();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ГруппаДанныхПриИзменении(Элемент)
	
	УстановитьОтборыДинамическогоСписка();

КонецПроцедуры


&НаСервере
Процедура УстановитьОтборыДинамическогоСписка()
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокКонтрагентов.Добавить(Контрагент);
	СписокКонтрагентов.Добавить(Новый(ТипЗнч(Контрагент)));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДополнительныеРеквизиты,
		"Контрагент",
		СписокКонтрагентов,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(Контрагент));

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДополнительныеРеквизиты,
		"ТипДокумента",
		ТипДокумента,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		ЗначениеЗаполнено(ТипДокумента));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ДополнительныеРеквизиты,
		"ГруппаДанных",
		ГруппаДанных,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(ГруппаДанных));
		
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Не Копирование Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТипДокумента", ТипДокумента);
		ПараметрыФормы.Вставить("ГруппаДанных", ГруппаДанных);
		ОткрытьФорму("РегистрСведений.НастройкиДополнительныхРеквизитовЭПД.Форма.ФормаЗаписи", ПараметрыФормы)
	КонецЕсли;

КонецПроцедуры
